org/2018-10-01-ted-ed.org
#+BEGIN_HTML
---
layout: post
title: "TED-ED-Video-1"
permalink: /:title/
tags: [Hi Language]
---
<head>
   <meta http-equiv="Content-Type" content="text/html;charset=utf-8">
</head>
#+END_HTML

This video is originally from [[https://ed.ted.com/][TED-ED]]. It tells us about the book Slaughterhouse-Five and the author Kurt Vonnegut. The audio version of this book can be downloaded from [[https://shop.ed.ted.com/products/slaughterhouse-five][This Website]].




+ abduct sb
   + take (someone) away illegally by force or deception

+ be out of chronological order

+ He hops (move by jumping on one foot) back and forth.

+ a middle-aged optometrist 验光师

+ If Amber does make a full recovery she will spend the rest of her life in captivity for her own protection.

+ Humiliation he endured/suffered in prison

+ take refuge in someplace

+ Allied forces

+ be utterly demolished
   + demolish/devastate/tear dowm/blast/blow up/destruct/pull down...

+ zany and outrageously
+ zany curves he generated

+ the stories are at odds with with this reality

+ set out to explore the ambiguity (uncertainty or inexactness of meaning in language)

+ ditched/get rid of/give up/abandon clear-cut fortunes

+ crop up in many of this book

+ Heavens are filled with rarefied, luminous spaghetti.

+ the course/process of the event

+ in the vastness/immensity of universe (endless, large, wide)
+ empty heroics
     + heroic adj. having the characteristics of a hero or heroine; very brave.
     + heroic n. behavior or talk that is bold or dramatic, especially excessively or unexpectedly so.
+ from the vantage (a place or position affording a good view of something) point I could see into the front garden
+ chrono-synclastic infundibulum
+ They see devastating futures for their earthly counterparts.
+ counterparts:
  + a person or thing holding a position or performing a function that corresponds to that of another person or thing in another place
  + one of two or more copies of a legal document: duplicate/transcript

+ devastating: highly destructive or damaging. devastate, devastation

+ adherent
  + n. someone who supports a particular party, person, or set of ideas/tenets/belief
  + v. adherent to/stick (fast) to
  + adherence n. adherence to

+ hold a (bleak/strong/positive..) view of

+ get pooped and demoralized

+ demoralized
   + cause (someone) to lose confidence or hope; dispirit
   + corrupt the morals

+ a few morsels of hope
   + morsel: a small piece or amount of food; a mouthful.

+ intersperse sth. with sth.
     + He intersperses his grim assessments with more than a few morsels of hope.

+ alter ego: a person's secondary or alternative personality.
