_posts/2018-10-01-ted-ed.html
<div class="HTML">


</div>

<p>
This video is originally from <a href="https://ed.ted.com/">TED-ED</a>. It tells us about the book Slaughterhouse-Five and the author Kurt Vonnegut. The audio version of this book can be downloaded from <a href="https://shop.ed.ted.com/products/slaughterhouse-five">This Website</a>.
</p>




<ul class="org-ul">
<li>abduct sb
<ul class="org-ul">
<li>take (someone) away illegally by force or deception</li>
</ul></li>

<li>be out of chronological order</li>

<li>He hops (move by jumping on one foot) back and forth.</li>

<li>a middle-aged optometrist 验光师</li>

<li>If Amber does make a full recovery she will spend the rest of her life in captivity for her own protection.</li>

<li>Humiliation he endured/suffered in prison</li>

<li>take refuge in someplace</li>

<li>Allied forces</li>

<li>be utterly demolished
<ul class="org-ul">
<li>demolish/devastate/tear dowm/blast/blow up/destruct/pull down&#x2026;</li>
</ul></li>

<li>zany and outrageously</li>
<li>zany curves he generated</li>

<li>the stories are at odds with with this reality</li>

<li>set out to explore the ambiguity (uncertainty or inexactness of meaning in language)</li>

<li>ditched/get rid of/give up/abandon clear-cut fortunes</li>

<li>crop up in many of this book</li>

<li>Heavens are filled with rarefied, luminous spaghetti.</li>

<li>the course/process of the event</li>

<li>in the vastness/immensity of universe (endless, large, wide)</li>
<li>empty heroics
<ul class="org-ul">
<li>heroic adj. having the characteristics of a hero or heroine; very brave.</li>
<li>heroic n. behavior or talk that is bold or dramatic, especially excessively or unexpectedly so.</li>
</ul></li>
<li>from the vantage (a place or position affording a good view of something) point I could see into the front garden</li>
<li>chrono-synclastic infundibulum</li>
<li>They see devastating futures for their earthly counterparts.</li>
<li>counterparts:
<ul class="org-ul">
<li>a person or thing holding a position or performing a function that corresponds to that of another person or thing in another place</li>
<li>one of two or more copies of a legal document: duplicate/transcript</li>
</ul></li>

<li>devastating: highly destructive or damaging. devastate, devastation</li>

<li>adherent
<ul class="org-ul">
<li>n. someone who supports a particular party, person, or set of ideas/tenets/belief</li>
<li>v. adherent to/stick (fast) to</li>
<li>adherence n. adherence to</li>
</ul></li>

<li>hold a (bleak/strong/positive..) view of</li>

<li>get pooped and demoralized</li>

<li>demoralized
<ul class="org-ul">
<li>cause (someone) to lose confidence or hope; dispirit</li>
<li>corrupt the morals</li>
</ul></li>

<li>a few morsels of hope
<ul class="org-ul">
<li>morsel: a small piece or amount of food; a mouthful.</li>
</ul></li>

<li>intersperse sth. with sth.
<ul class="org-ul">
<li>He intersperses his grim assessments with more than a few morsels of hope.</li>
</ul></li>

<li>alter ego: a person's secondary or alternative personality.</li>
</ul>
